
namespace QQGameTool
{
    internal class Data
    {
        static Data()
        {
            软件说明 = string.Concat(new string[]
           {
               "\r\n***************************************************************************",
               "\r\n*                    2022版火拼俄罗斯不落块插件纪念版                     *",
               "\r\n*            插件内核基于原作者[oneaddone]的2011年内部测试版开发          *",
               "\r\n*                                                                         *",
               "\r\n*  1.自动开始：无需每次按F2开始游戏，勾选后自动开始游戏                   *",
               "\r\n*  2.方块不落：勾选后方块不下落，相当于暂停功能                           *",
               "\r\n*  3.键盘加速：勾选后内置键盘加速功能,不勾选可使用其他键盘加速器          *",
               "\r\n*  4.半秒自杀：游戏开始后半秒自杀，刷负分专用功能,可自定义时间            *",
               "\r\n*  5.十秒自杀：对手上分专用功能,可自定义时间                              *",
               "\r\n*  6.速度测试：每次方块落地更新当前块速和当前开局用时总时长               *",
               "\r\n*  a.本软件可自定义[操作按键,控制按键,自杀时长]]                          *",
               "\r\n*  b.本软件可自定义[Logo文本,功能权限,界面布局]                           *",
               "\r\n*  c.本软件可脱离游戏窗口直接修改插件内置配置参数                         *",
               "\r\n*  d.本软件包含游戏掉线监控报警&自动关闭掉线窗口&游戏中QQ号码获取         *",
               "\r\n*                                                                         *",
               "\r\n*  注意：★授权码在本软件[关于软件]页面和打开的网址上,猜一猜吧★          *",
               "\r\n*                                                                         *",
               "\r\n*                                  BY:工控闪剑    Email 2590800@qq.com    *",
               "\r\n*                                                        2022年9月12日    *",
               "\r\n***************************************************************************",
               "\r\n",
               "\r\n版本更新历史:",
               "\r\n",
               "\r\nDATE: 2022年9月19日",
               "\r\n1.12日开始就已经剥离掉线检测功能了,独立发布专用的插件生成器",
               "\r\n2.原因:子线程数据处理量大,关闭软件卡死;QQ号某些系统获取不到",
               "\r\n3.这个版本我已经把掉线的功能屏蔽掉了,有兴趣可以把子线程注释取消慢慢玩",
               "\r\n4.这个版本不再更新,我已经放弃了,因为插件生成和掉线检测独立版本已发布",
               "\r\n5.这个版本存在的意义在于可以自定义游戏操作按键,不能自定义布局界面",
               "\r\n6.掉线检测独立版本采用新的指针逻辑获取游戏账号,读取一次内存即可获取",
               "\r\n",
               "\r\nDATE: 2022年9月11日",
               "\r\n1.掉线检测与账号检测功能正式加入子线程执行",
               "\r\n2.新增子线程委托方式更新主线程窗体控件属性",
               "\r\n3.自动清理内存功能由检测账号模块运行改为子线程委托队列方式运行",
               "\r\n",
               "\r\nDATE: 2022年9月10日",
               "\r\n1.主窗口代码加入#region,方便快速定位代码",
               "\r\n2.调整主窗体代码整体架构,为多线程运行做准备",
               "\r\n",
               "\r\nDATE: 2022年9月8日",
               "\r\n1.新增监控模式自动清理自身内存占用功能(测试)",
               "\r\n",
               "\r\nDATE: 2022年9月7日",
               "\r\n1.修复极端情况下找不到掉线游戏窗口的问题",
               "\r\n2.修复了一处掉线进程检测逻辑不严谨的BUG",
               "\r\n3.★新增实时获取当前所有游戏窗口的游戏QQ号码功能(游戏窗口使用的QQ号码)★",
               "\r\n3.开放操作按键界面预览权限,配置按键按钮改为开启/关闭获取游戏窗口QQ号码功能",
               "\r\n4.彻底抛弃通过注册表数据获取游戏路径功能,提高软件启动速度",
               "\r\n5.完善通过游戏进程获取插件生成路径和路径效验功能",
               "\r\n6.新增文件路径强转长文件名功能,避免出现路径含有~符号的问题",
               "\r\n7.软件NET运行库版本由4.0改到4.5版本,增强64位系统兼容性",
               "\r\n8.新增游戏路径配置保存功能,只要软件正确获取游戏路径自动写入配置数据",
               "\r\n9.调整程序注册表和文件路径检测逻辑架构,提高逻辑检测严谨性",
               "\r\n10.增加关闭掉线游戏窗口功能线程延迟,解决掉线窗口过多程序卡死的问题",
               "\r\n11.增加获取QQ号码线程执行间隔,降低内存和CPU的负载",
               "\r\n",
               "\r\n●●●●●★软件更名为刷分辅助工具★●●●●●",
               "\r\n",
               "\r\nDATE: 2022年9月6日",
               "\r\n1.新增掉线自动关闭弹窗功能(可选),提高操作便捷性(API操作)",
               "\r\n2.运行开始时间由按钮点击时间改为最后一个游戏窗口加载的时间",
               "\r\n3.新增API+NET混合多条件效验检测弹窗,关闭弹窗及关键游戏进程功能",
               "\r\n4.优化程序代码,解决内存占用过多的问题",
               "\r\n",
               "\r\nDATE: 2022年9月5日",
               "\r\n1.新增掉线数据统计功能,[开始时间/掉线时间/处理时间]一目了然",
               "\r\n2.时间统计功能由定时器改为系统时间对比,提高准确性",
               "\r\n3.新增自定义插件生成目录功能,提高操作便捷性",
               "\r\n4.■新增通过游戏进程判断插件生成的游戏目录功能■",
               "\r\n",
               "\r\nDATE: 2022年9月4日",
               "\r\n1.新增授权码读写功能,重启软件无需再次输入授权码",
               "\r\n2.新增点击[检查更新]重新输入授权码功能",
               "\r\n3.修复了新版本游戏核心文件打补丁报错失效的问题",
               "\r\n4.■新增游戏刷分掉线报监控警功能(播放音乐,同目录文件[music.mp3]■",
               "\r\n",
               "\r\nDATE: 2022年9月3日",
               "\r\n1.完善了32位操作系统与64位操作系统判断逻辑,根据特征自动查找对应游戏数据",
               "\r\n2.完善QQ游戏大厅版本判定代码,降低误诊率",
               "\r\n3.新增读取自定义操作按键数据功能,无需手动设置按键",
               "\r\n",
               "\r\nDATE: 2022年9月2日",
               "\r\n1.新增对QQ游戏大厅下载器下载的最新版本俄罗斯方块支持",
               "\r\n2.基于文件效验方式进行选择性替换核心模块,无需使用专用修改版Tetris",
               "\r\n2.新增自动分析游戏路径,无需放置Tetris目录(本机存在多版本游戏大厅除外)",
               "\r\n",
               "\r\nDATE: 2022年9月1日",
               "\r\n1.新增功能定制分类模块授权功能,共五组授权码",
               "\r\n2.控件名称调整",
               "\r\n2.关于软件界面新增授权码输入框,●授权码请在在软件内查找线索[(^_^)]",
               "\r\n",
               "\r\nDATE: 2022年8月31日",
               "\r\n1.完善自定义自杀时长功能",
               "\r\n2.完善自定义Logo&自定义显示属性代码",
               "\r\n3.添加基础授权验证功能",
               "\r\n3.优化原始内核部分代码,预留后期功能接口",
               "\r\n",
               "\r\nDATE: 2022年8月30日",
               "\r\n1.增加界面定制选项,分类功能布局",
               "\r\n2.添加自杀自定义延时控件,添加自定义Logo控件,添加功能选项控件",
               "\r\n3.程序架构调整,功能分类",
               "\r\n3.添加对应功能指针API",
               "\r\n",
               "\r\nDATE: 2022年8月29日",
               "\r\n1.增加配置参数选项,完善相关功能",
               "\r\n2.添加键盘加速参数比例换算功能",
               "\r\n3.添加首次延迟参数比例换算功能",
               "\r\n",
               "\r\nDATE: 2022年8月28日",
               "\r\n1.设计本软件UI界面,布局控件",
               "\r\n2.增加自定义操作按键配置功能",
               "\r\n3.增加控制按键自定义功能",
               "\r\n4.增加屏蔽数据统计按键功能",
               "\r\n5.增加生成文件功能",
               "\r\n",
               "\r\nDATE: 2022年8月27日",
               "\r\n1.自动准备热键API修正",
               "\r\n2.数据统计热键API修正",
               "\r\n",
               "\r\nDATE: 2022年8月25日",
               "\r\n1.新版本插件作业开始",
               "\r\n2.新版本操作按键默认值修正",
               "\r\n3.第二版参数设置批处理编译",
               "\r\n4.新版本插件UI布局调整,恢复隐藏控件",
               "\r\n",
               "\r\nDATE: 2022年8月23日",
               "\r\n1.旧版本插件优化版发布(CSDN)",
               "\r\n2.第一版默认配置参数配置批处理编译",
               "\r\n",
               "\r\nDATE: 2022年8月22日",
               "\r\n1.旧版本插件操作按默认值修正",
               "\r\n",
               "\r\nDATE: 2022年8月20日",
               "\r\n1.旧版本插件10秒自杀参数默认值修正",
               "\r\n",
               "\r\nDATE: 2022年8月17日",
               "\r\n1.旧版本(07版)作业开始",
               "\r\n2.旧版本插件UI布局调整",
               "\r\n3.游戏主程序导入表修正",
               "\r\n4.旧版本插件默认写入配置参数分析",
               "\r\n",
               "\r\n",
               "\r\n■■■■■■■■感谢你能看到最后■■■■■■■■",
               "\r\n",
               "\r\n1.点击关于软件页面的两个文字链接后会显示操作按键界面,但无法生成",
               "\r\n",
               "\r\n2.请大家多多支持本人B站和CSDN博客,更多精彩内容欢迎您的点击评论",
               "\r\n",
               "\r\n3.授权码输入正确后会显示LV.等级,目前最高LV.5,授权码一共5组,对应不同授权等级",
               "\r\n",
               "\r\n4.授权码与 纯数字组合或纯字母有关系,你在软件上或者打开的网站上都能看得到",
               "\r\n",
               "\r\n5.本软件纯属个人爱好开发,如发现BUG请发送E-mail到本人邮箱(截图+文字说明)",
               "\r\n"
           });
            生成提示 = string.Concat(new string[]
            {
                "检测到游戏窗口未关闭!",
                "\r\n本软件将根据您打开的游戏窗口所在目录进行生成操作",
                "\r\n鉴于安全考虑本软件不会关闭你的游戏窗口!",
                "\r\n请关闭所有游戏窗口后重新点击生成按钮生成插件!"
            });
            键码表 = new string[]
           {"", "鼠标左键", "鼠标右键", "Cancel", "鼠标中键", "XButton1", "XButton2", "", "退格键", "Tab键",
				"", "", "Clear", "回车键", "", "", "Shift", "Ctrl", "Alt", "Pause",
				"CapsLock", "Kana", "Hangul", "Junja", "Final", "Hanja", "Kanji", "Esc键", "Convert", "Nonconvert",
				"Accept", "Modechange", "空格键", "PageUp", "PageDown", "End", "Home", "←", "↑", "→",
				"↓", "Select", "Print", "Execute", "Snapshot", "Insert", "DDelete", "Help", "0", "1",
				"2", "3", "4", "5", "6", "7", "8", "9", "", "",
				"", "", "", "", "", "A", "B", "C", "D", "E",
				"F", "G", "H", "I", "J", "K", "L", "M", "N", "O",
				"P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y",
				"Z", "LWin", "RWin", "Apps", "", "Sleep", "NUM 0", "NUM 1", "NUM 2", "NUM 3",
				"NUM 4", "NUM 5", "NUM 6", "NUM 7", "NUM 8", "NUM 9", "NUM *", "NUM +", "NUM Enter", "NUM -",
				"NUM .", "NUM /", "F1键", "F2键", "F3键", "F4键", "F5键", "F6键", "F7键", "F8键",
				"F9键", "F10键", "F11键", "F12键", "F13键", "F14键", "F15键", "F16键", "F17键", "F18键",
				"F19键", "F20键", "F21键", "F22键", "F23键", "F24键", "", "", "", "",
				"", "", "", "", "NumLock", "Scroll", "", "", "", "",
				"", "", "", "", "", "", "", "", "", "",
				"LShift", "RShift", "LCtrl", "RCtrl", "LAlt", "RAlt", "wwwBack", "wwwForward", "wwwRefresh", "wwwStop",
				"wwwSearch", "wwwFavorites", "wwwHome", "VolumeMute", "VolumeDown", "VolumeUp", "MediaNext", "MediaPrev", "MediaStop", "MediaPlay",
				"LaunchMal", "LaunchMediaSelect", "LaunchApp1", "LaunchApp2", "", "", ";:", "=+", ",<", "-_",
				".>", "/?", "`~", "", "", "", "", "", "", "",
				"", "", "", "", "", "", "", "", "", "",
				"", "", "", "", "", "", "", "", "", "[{",
				"＼｜", "]}", "‘“", "Oem 8", "", "", "Oem 102", "", "", "",
				"", "Packet", "", "", "", "", "", "", "", "ProcessKey",
				"", "", "", "", "", "", "Attn", "Crsel", "Exsel", "Ereof",
				"Play", "Zoom", "Noname", "Pa1", "OemClear" 
           };
            键盘速度 = new string[]
           {
               "无效值","300","500","700","900","1100","1300","1500","1700","1900",
               "2100","2200","2300","2400","2500","2600","2700","2800","2900","3000",
               "3100","3200","3300","3400","3500","3600","3700","3800","3900","4000",
               "4100","4200","4300","4400","4500","4600","4700","4800","4900","5000",
               "5100","5200","5300","5400","5500","5600","5700","5800","5900","6000",
               "6200","6400","6600","6800","7000","7200","7400","7600","7800","8000",
               "8200","8400","8600","8800","9000","9200","9400","9600","9800","10000",
               "超级快"
           };
            首次延时 = new int[]
            {
                0,100,100,100,100,100,100,100,100,100,
                100,100,100,100,100,100,100,100,100,100,
                100,98,95,93,90,89,87,84,82,81,
                79,78,76,75,73,72,70,70,69,68,
                66,65,64,64,63,62,61,60,59,60,
                58,56,56,55,53,53,52,51,51,50,
                49,49,48,48,48,47,46,47,46,46,
                46
            };
            reg显示速度 = "SpeedShow";
            reg键盘加速 = "Accelerator";
            reg超快响应 = "SuperFast";
            reg键盘速度 = "Speed";
            reg首次延时 = "Delay";
            reg授权码 = "LicenseKey";
            reg游戏路径 = "GamePath";
        }
        //软件全局变量
        //地址变量-按键KeyCode
        internal const int jadr顺变 = 5504;
        internal const int jadr逆变 = 5514;
        internal const int jadr左移 = 5524;
        internal const int jadr右移 = 5534;
        internal const int jadr加落 = 5544;
        internal const int jadr直落 = 5554;
        internal const int jadr显示 = 11992;
        internal const int jadr统计 = 12069;
        //
        internal const int nadrn半秒自杀 = 12483;
        internal const int nadrn十秒自杀 = 12423;
        //地址变量-控件属性
        internal const int kadr隐藏面板 = 175491;
        internal const int kadr键盘速度 = 175551;
        internal const int kadr首次延时 = 175615;
        internal const int kadr键盘加速 = 175711;
        internal const int kadr显示速度 = 175783;
        internal const int kadr自动开始 = 175823;
        internal const int kadr十秒自杀 = 175863;
        internal const int kadr超快响应 = 175903;
        internal const int kadr方块不落 = 175943;
        internal const int kadr数据统计 = 175983;
        internal const int kadr标题按钮 = 176023;
        internal const int kadr半秒自杀 = 176083;
        //
        internal const int tadr顶部文本 = 176040;//暂不考虑修改
        internal const int tadr顶部文本1 = 158784;
        internal const int tadr顶部文本2 = 158720;
        internal const int tadr底部文本 = 175508;
        internal const int text最大长度 = 28;
        
        //状态变量-控件属性
        internal const byte StaBase = 64;
        internal const byte StaV1U1 = 80;
        internal const byte StaV1U0 = 88;
        internal const byte StaV0U1 = 64;
        internal const byte StaV0U0 = 72;
        //数组变量
        internal static string 软件说明;
        internal static string 生成提示;
        internal static string[] 键码表;
        internal static string[] 键盘速度;
        internal static int[] 首次延时;
        //注册表子键
        internal static string reg显示速度;
        internal static string reg键盘加速;
        internal static string reg超快响应;
        internal static string reg键盘速度;
        internal static string reg首次延时;
        internal static string reg授权码;
        internal static string reg游戏路径;

    }
}
